scc2425-artillery-tests/benchmark_logs/benchmark_log_targetdesc_Kubernets_Final_test_1_20241214_232946.txt
Running user_register.yaml on http://127.0.0.1/tukano-1/rest
Test run id: twehf_fawenrr7zpxpfyzdtk4w9kw97h73h_mqpx
Phase started: simple_post (index: 0, duration: 20s) 23:29:48(+0000)

--------------------------------------
Metrics for period to: 23:29:50(+0000) (width: 1.811s)
--------------------------------------

http.codes.404: ................................................................ 57
http.downloaded_bytes: ......................................................... 38931
http.request_rate: ............................................................. 32/sec
http.requests: ................................................................. 57
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 9
  mean: ........................................................................ 2.9
  median: ...................................................................... 2
  p95: ......................................................................... 6
  p99: ......................................................................... 6
http.response_time.4xx:
  min: ......................................................................... 1
  max: ......................................................................... 9
  mean: ........................................................................ 2.9
  median: ...................................................................... 2
  p95: ......................................................................... 6
  p99: ......................................................................... 6
http.responses: ................................................................ 57
plugins.metrics-by-endpoint./tukano-1/rest/users/.codes.404: ................... 19
plugins.metrics-by-endpoint./tukano-1/rest/users/{{ userId }}?pwd={{ pwd }}....  19
plugins.metrics-by-endpoint./tukano-1/rest/users/{{ userId}}?pwd={{ pwd }}.c...  19
plugins.metrics-by-endpoint.response_time./tukano-1/rest/users/:
  min: ......................................................................... 2
  max: ......................................................................... 9
  mean: ........................................................................ 4.6
  median: ...................................................................... 4
  p95: ......................................................................... 6
  p99: ......................................................................... 6
plugins.metrics-by-endpoint.response_time./tukano-1/rest/users/{{ userId }}?pwd={{ pwd }}:
  min: ......................................................................... 1
  max: ......................................................................... 5
  mean: ........................................................................ 1.9
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 3
plugins.metrics-by-endpoint.response_time./tukano-1/rest/users/{{ userId}}?pwd={{ pwd }}:
  min: ......................................................................... 1
  max: ......................................................................... 5
  mean: ........................................................................ 2.3
  median: ...................................................................... 2
  p95: ......................................................................... 4
  p99: ......................................................................... 4
vusers.completed: .............................................................. 19
vusers.created: ................................................................ 19
vusers.created_by_name.TuKanoWholeUserFlow: .................................... 19
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 9.4
  max: ......................................................................... 21.5
  mean: ........................................................................ 14.2
  median: ...................................................................... 12.8
  p95: ......................................................................... 21.5
  p99: ......................................................................... 21.5


--------------------------------------
Metrics for period to: 23:30:00(+0000) (width: 9.909s)
--------------------------------------

http.codes.404: ................................................................ 300
http.downloaded_bytes: ......................................................... 204900
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 11
  mean: ........................................................................ 3.2
  median: ...................................................................... 3
  p95: ......................................................................... 7
  p99: ......................................................................... 8.9
http.response_time.4xx:
  min: ......................................................................... 0
  max: ......................................................................... 11
  mean: ........................................................................ 3.2
  median: ...................................................................... 3
  p95: ......................................................................... 7
  p99: ......................................................................... 8.9
http.responses: ................................................................ 300
plugins.metrics-by-endpoint./tukano-1/rest/users/.codes.404: ................... 100
plugins.metrics-by-endpoint./tukano-1/rest/users/{{ userId }}?pwd={{ pwd }}....  100
plugins.metrics-by-endpoint./tukano-1/rest/users/{{ userId}}?pwd={{ pwd }}.c...  100
plugins.metrics-by-endpoint.response_time./tukano-1/rest/users/:
  min: ......................................................................... 2
  max: ......................................................................... 11
  mean: ........................................................................ 5
  median: ...................................................................... 5
  p95: ......................................................................... 7.9
  p99: ......................................................................... 10.9
plugins.metrics-by-endpoint.response_time./tukano-1/rest/users/{{ userId }}?pwd={{ pwd }}:
  min: ......................................................................... 0
  max: ......................................................................... 6
  mean: ........................................................................ 2.2
  median: ...................................................................... 2
  p95: ......................................................................... 5
  p99: ......................................................................... 6
plugins.metrics-by-endpoint.response_time./tukano-1/rest/users/{{ userId}}?pwd={{ pwd }}:
  min: ......................................................................... 1
  max: ......................................................................... 8
  mean: ........................................................................ 2.4
  median: ...................................................................... 2
  p95: ......................................................................... 4
  p99: ......................................................................... 7
vusers.completed: .............................................................. 100
vusers.created: ................................................................ 100
vusers.created_by_name.TuKanoWholeUserFlow: .................................... 100
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 6.4
  max: ......................................................................... 25.7
  mean: ........................................................................ 14.1
  median: ...................................................................... 13.9
  p95: ......................................................................... 21.1
  p99: ......................................................................... 25.3


Phase completed: simple_post (index: 0, duration: 20s) 23:30:08(+0000)

--------------------------------------
Metrics for period to: 23:30:10(+0000) (width: 8.007s)
--------------------------------------

http.codes.404: ................................................................ 243
http.downloaded_bytes: ......................................................... 165969
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 243
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 166
  mean: ........................................................................ 4.4
  median: ...................................................................... 2
  p95: ......................................................................... 6
  p99: ......................................................................... 34.8
http.response_time.4xx:
  min: ......................................................................... 1
  max: ......................................................................... 166
  mean: ........................................................................ 4.4
  median: ...................................................................... 2
  p95: ......................................................................... 6
  p99: ......................................................................... 34.8
http.responses: ................................................................ 243
plugins.metrics-by-endpoint./tukano-1/rest/users/.codes.404: ................... 81
plugins.metrics-by-endpoint./tukano-1/rest/users/{{ userId }}?pwd={{ pwd }}....  81
plugins.metrics-by-endpoint./tukano-1/rest/users/{{ userId}}?pwd={{ pwd }}.c...  81
plugins.metrics-by-endpoint.response_time./tukano-1/rest/users/:
  min: ......................................................................... 1
  max: ......................................................................... 124
  mean: ........................................................................ 6.4
  median: ...................................................................... 4
  p95: ......................................................................... 10.9
  p99: ......................................................................... 34.8
plugins.metrics-by-endpoint.response_time./tukano-1/rest/users/{{ userId }}?pwd={{ pwd }}:
  min: ......................................................................... 1
  max: ......................................................................... 47
  mean: ........................................................................ 2.7
  median: ...................................................................... 2
  p95: ......................................................................... 5
  p99: ......................................................................... 8.9
plugins.metrics-by-endpoint.response_time./tukano-1/rest/users/{{ userId}}?pwd={{ pwd }}:
  min: ......................................................................... 1
  max: ......................................................................... 166
  mean: ........................................................................ 4
  median: ...................................................................... 2
  p95: ......................................................................... 4
  p99: ......................................................................... 7
vusers.completed: .............................................................. 81
vusers.created: ................................................................ 81
vusers.created_by_name.TuKanoWholeUserFlow: .................................... 81
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 6.3
  max: ......................................................................... 235.7
  mean: ........................................................................ 17.2
  median: ...................................................................... 11.6
  p95: ......................................................................... 24.8
  p99: ......................................................................... 141.2


All VUs finished. Total time: 21 seconds

--------------------------------
Summary report @ 23:30:09(+0000)
--------------------------------

http.codes.404: ................................................................ 600
http.downloaded_bytes: ......................................................... 409800
http.request_rate: ............................................................. 31/sec
http.requests: ................................................................. 600
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 166
  mean: ........................................................................ 3.6
  median: ...................................................................... 2
  p95: ......................................................................... 6
  p99: ......................................................................... 10.9
http.response_time.4xx:
  min: ......................................................................... 0
  max: ......................................................................... 166
  mean: ........................................................................ 3.6
  median: ...................................................................... 2
  p95: ......................................................................... 6
  p99: ......................................................................... 10.9
http.responses: ................................................................ 600
plugins.metrics-by-endpoint./tukano-1/rest/users/.codes.404: ................... 200
plugins.metrics-by-endpoint./tukano-1/rest/users/{{ userId }}?pwd={{ pwd }}....  200
plugins.metrics-by-endpoint./tukano-1/rest/users/{{ userId}}?pwd={{ pwd }}.c...  200
plugins.metrics-by-endpoint.response_time./tukano-1/rest/users/:
  min: ......................................................................... 1
  max: ......................................................................... 124
  mean: ........................................................................ 5.5
  median: ...................................................................... 5
  p95: ......................................................................... 7.9
  p99: ......................................................................... 12.1
plugins.metrics-by-endpoint.response_time./tukano-1/rest/users/{{ userId }}?pwd={{ pwd }}:
  min: ......................................................................... 0
  max: ......................................................................... 47
  mean: ........................................................................ 2.4
  median: ...................................................................... 2
  p95: ......................................................................... 5
  p99: ......................................................................... 7.9
plugins.metrics-by-endpoint.response_time./tukano-1/rest/users/{{ userId}}?pwd={{ pwd }}:
  min: ......................................................................... 1
  max: ......................................................................... 166
  mean: ........................................................................ 3.1
  median: ...................................................................... 2
  p95: ......................................................................... 4
  p99: ......................................................................... 7
vusers.completed: .............................................................. 200
vusers.created: ................................................................ 200
vusers.created_by_name.TuKanoWholeUserFlow: .................................... 200
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 6.3
  max: ......................................................................... 235.7
  mean: ........................................................................ 15.4
  median: ...................................................................... 12.6
  p95: ......................................................................... 22
  p99: ......................................................................... 42.5

==================================================

Running upload_shorts.yaml on http://127.0.0.1/tukano-1/rest
Test run id: t9xp6_mqz46qz5bdywfbcjgkqtg85jygecf_kcgm
Parsed 201 rows
Parsed 201 rows
Parsed 201 rows
[...]
Phase started: Warm up (index: 0, duration: 10s) 23:30:11(+0000)

worker error, id: 1 SyntaxError [Error]: Unexpected token '<', "<!doctype "... is not valid JSON
    at JSON.parse (<anonymous>)
    at processVideoAddReply (/Users/oliveira/Documents/Cloud/scc2425/scc2425-artillery-tests/test-utils.js:214:35)
    at iteratee (/opt/homebrew/lib/node_modules/artillery/node_modules/@artilleryio/int-core/lib/engine_http.js:655:21)
    at /opt/homebrew/lib/node_modules/artillery/node_modules/async/dist/async.js:3113:16
    at replenish (/opt/homebrew/lib/node_modules/artillery/node_modules/async/dist/async.js:1014:17)
    at /opt/homebrew/lib/node_modules/artillery/node_modules/async/dist/async.js:1019:9
    at eachLimit$1 (/opt/homebrew/lib/node_modules/artillery/node_modules/async/dist/async.js:3199:24)
    at Object.<anonymous> (/opt/homebrew/lib/node_modules/artillery/node_modules/async/dist/async.js:1049:16)
    at captured (/opt/homebrew/lib/node_modules/artillery/node_modules/@artilleryio/int-core/lib/engine_http.js:636:21)
    at Object.captureOrMatch (/opt/homebrew/lib/node_modules/artillery/node_modules/@artilleryio/int-commons/engine_util.js:399:12)
Error: 

==================================================

Running realistic_flow.yaml on http://127.0.0.1/tukano-1/rest
Test run id: txg9j_x88p3k3hp537qnwhfj9r8p6yg3tht_p9hn
Parsed 201 rows
Parsed 201 rows
Parsed 201 rows
[...]
Phase started: Warm up (index: 0, duration: 10s) 23:30:14(+0000)

worker error, id: 2 SyntaxError [Error]: Unexpected token '<', "<!doctype "... is not valid JSON
    at JSON.parse (<anonymous>)
    at processVideoGetReply (/Users/oliveira/Documents/Cloud/scc2425/scc2425-artillery-tests/test-utils.js:230:35)
    at iteratee (/opt/homebrew/lib/node_modules/artillery/node_modules/@artilleryio/int-core/lib/engine_http.js:655:21)
    at /opt/homebrew/lib/node_modules/artillery/node_modules/async/dist/async.js:3113:16
    at replenish (/opt/homebrew/lib/node_modules/artillery/node_modules/async/dist/async.js:1014:17)
    at /opt/homebrew/lib/node_modules/artillery/node_modules/async/dist/async.js:1019:9
    at eachLimit$1 (/opt/homebrew/lib/node_modules/artillery/node_modules/async/dist/async.js:3199:24)
    at Object.<anonymous> (/opt/homebrew/lib/node_modules/artillery/node_modules/async/dist/async.js:1049:16)
    at captured (/opt/homebrew/lib/node_modules/artillery/node_modules/@artilleryio/int-core/lib/engine_http.js:636:21)
    at Object.captureOrMatch (/opt/homebrew/lib/node_modules/artillery/node_modules/@artilleryio/int-commons/engine_util.js:399:12)
Error: 

==================================================

Running user_delete.yaml on http://127.0.0.1/tukano-1/rest
Test run id: t7wdk_ke4jzk86c59meee463gptnzjg6fya_pk4b
Phase started: simple_post (index: 0, duration: 20s) 23:30:22(+0000)

--------------------------------------
Metrics for period to: 23:30:30(+0000) (width: 7.506s)
--------------------------------------

http.codes.404: ................................................................ 76
http.downloaded_bytes: ......................................................... 51908
http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 76
http.response_time:
  min: ......................................................................... 2
  max: ......................................................................... 49
  mean: ........................................................................ 6.3
  median: ...................................................................... 5
  p95: ......................................................................... 10.9
  p99: ......................................................................... 37
http.response_time.4xx:
  min: ......................................................................... 2
  max: ......................................................................... 49
  mean: ........................................................................ 6.3
  median: ...................................................................... 5
  p95: ......................................................................... 10.9
  p99: ......................................................................... 37
http.responses: ................................................................ 76
vusers.completed: .............................................................. 76
vusers.created: ................................................................ 76
vusers.created_by_name.TuKanoDeleteUserFlow: ................................... 76
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3.7
  max: ......................................................................... 52
  mean: ........................................................................ 9.1
  median: ...................................................................... 7.3
  p95: ......................................................................... 15.3
  p99: ......................................................................... 47.9


Phase completed: simple_post (index: 0, duration: 20s) 23:30:42(+0000)

--------------------------------------
Metrics for period to: 23:30:40(+0000) (width: 9.905s)
--------------------------------------

http.codes.404: ................................................................ 100
http.downloaded_bytes: ......................................................... 68300
http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 100
http.response_time:
  min: ......................................................................... 2
  max: ......................................................................... 20
  mean: ........................................................................ 4.9
  median: ...................................................................... 5
  p95: ......................................................................... 7.9
  p99: ......................................................................... 13.1
http.response_time.4xx:
  min: ......................................................................... 2
  max: ......................................................................... 20
  mean: ........................................................................ 4.9
  median: ...................................................................... 5
  p95: ......................................................................... 7.9
  p99: ......................................................................... 13.1
http.responses: ................................................................ 100
vusers.completed: .............................................................. 100
vusers.created: ................................................................ 100
vusers.created_by_name.TuKanoDeleteUserFlow: ................................... 100
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3.4
  max: ......................................................................... 33
  mean: ........................................................................ 7.5
  median: ...................................................................... 7
  p95: ......................................................................... 11.4
  p99: ......................................................................... 14.7


--------------------------------------
Metrics for period to: 23:30:50(+0000) (width: 2.303s)
--------------------------------------

http.codes.404: ................................................................ 24
http.downloaded_bytes: ......................................................... 16392
http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 24
http.response_time:
  min: ......................................................................... 2
  max: ......................................................................... 8
  mean: ........................................................................ 4.8
  median: ...................................................................... 5
  p95: ......................................................................... 7
  p99: ......................................................................... 7
http.response_time.4xx:
  min: ......................................................................... 2
  max: ......................................................................... 8
  mean: ........................................................................ 4.8
  median: ...................................................................... 5
  p95: ......................................................................... 7
  p99: ......................................................................... 7
http.responses: ................................................................ 24
vusers.completed: .............................................................. 24
vusers.created: ................................................................ 24
vusers.created_by_name.TuKanoDeleteUserFlow: ................................... 24
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3.6
  max: ......................................................................... 10.2
  mean: ........................................................................ 7
  median: ...................................................................... 6.9
  p95: ......................................................................... 9.5
  p99: ......................................................................... 10.1


All VUs finished. Total time: 21 seconds

--------------------------------
Summary report @ 23:30:44(+0000)
--------------------------------

http.codes.404: ................................................................ 200
http.downloaded_bytes: ......................................................... 136600
http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 200
http.response_time:
  min: ......................................................................... 2
  max: ......................................................................... 49
  mean: ........................................................................ 5.5
  median: ...................................................................... 5
  p95: ......................................................................... 8.9
  p99: ......................................................................... 19.9
http.response_time.4xx:
  min: ......................................................................... 2
  max: ......................................................................... 49
  mean: ........................................................................ 5.5
  median: ...................................................................... 5
  p95: ......................................................................... 8.9
  p99: ......................................................................... 19.9
http.responses: ................................................................ 200
vusers.completed: .............................................................. 200
vusers.created: ................................................................ 200
vusers.created_by_name.TuKanoDeleteUserFlow: ................................... 200
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3.4
  max: ......................................................................... 52
  mean: ........................................................................ 8.1
  median: ...................................................................... 7.2
  p95: ......................................................................... 12.8
  p99: ......................................................................... 32.8

==================================================